org/notes/latexsetup.org
#+SETUPFILE: ../../org_templates/level-1.org

#+TITLE: LaTeX

** [[file:~/Desktop/webpage/public_html/index.html][Home]] | [[file:~/Desktop/webpage/public_html/notes.html][Notes]] | [[file:~/Desktop/webpage/public_html/projects.html][Projects]] | [[file:~/Desktop/webpage/public_html/misc.html][Misc]]

------------

LaTeX is a very useful language for writing professional looking documents and articles. 
I try to use it for all my assignments and letters/resume. 
It may take some time to learn (1-2 hours max) but its very useful in the long term. 
Most of the research papers and technical books make use of it. 
a
On my Ubuntu/Debian system I usually install the full texlive package since it does 
not take much space (relatively speaking! ~1.8 GB) and saves the hassle of 
installing individual packages. I pair it up with Texmaker editor which works very 
well for my needs. For an online solution, I found [[https://www.sharelatex.com/][ShareLatex]] to very convinient. 
It also has many short guides on various topics.
 
*** References:
- [[https://en.wikibooks.org/wiki/LaTeX/][Latex wikibook]]
- [[http://www.latextemplates.com/][Templates]]
- [[https://github.com/dustinvtran/latex-templates][More templates]]
- [[https://www.sharelatex.com/blog/latex-guides/beginners-tutorial.html][Tutorial (sharelatex)]]
- The times (or charter) font looks much better than the default latin-modern font!
- Best path is to go all in after reading a short tutorial and search the questions as they come up. (especially true for math mode!)

---------



