notes/latexsetup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LaTeX</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">LaTeX</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a href="../../ninception.github.io/index.html">Home</a> | <a href="../../ninception.github.io/notes.html">Notes</a> | <a href="../../ninception.github.io/projects.html">Projects</a> | <a href="../../ninception.github.io/misc.html">Misc</a></h2>
<div class="outline-text-2" id="text-1">
<hr  />

<p>
LaTeX is a very useful language for writing professional looking documents and articles. 
I try to use it for all my assignments and letters/resume. 
It may take some time to learn (1-2 hours max) but its very useful in the long term. 
Most of the research papers and technical books make use of it. 
a
On my Ubuntu/Debian system I usually install the full texlive package since it does 
not take much space (relatively speaking! ~1.8 GB) and saves the hassle of 
installing individual packages. I pair it up with Texmaker editor which works very 
well for my needs. For an online solution, I found <a href="https://www.sharelatex.com/">ShareLatex</a> to very convinient. 
It also has many short guides on various topics.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">References:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://en.wikibooks.org/wiki/LaTeX/">Latex wikibook</a>
</li>
<li><a href="http://www.latextemplates.com/">Templates</a>
</li>
<li><a href="https://github.com/dustinvtran/latex-templates">More templates</a>
</li>
<li><a href="https://www.sharelatex.com/blog/latex-guides/beginners-tutorial.html">Tutorial (sharelatex)</a>
</li>
<li>The times (or charter) font looks much better than the default latin-modern font!
</li>
<li>Best path is to go all in after reading a short tutorial and search the questions as they come up. (especially true for math mode!)
</li>
</ul>

<hr  />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><small> Created with <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</small></p>
<p class="validation"></p>
</div>
</body>
</html>
